<template>
  <section class="news__section">
    <div class="container">
      <div class="row">
        <h2 class="news-title">{{ title }}</h2>
        
      </div>
    </div>
  </section>
</template>

<script>
import NewsSwiper from '@/components/NewsSwiper.vue'

export default {
  name: 'News Page',
  data() {
    return {
      title: 'Статьи и новости',
      slides: [
        {
          img: '',
          title: 'Тренды в строительстве дома',
          txt: 'Небольшой мастер-класс, как самому сделать грифельную стену дома.',
          date: '28.02.2024'
        },
        {
          img: '',
          title: '2D- или 3D-анимация',
          txt: 'Самое яркое и запоминающееся средство для привлечения потребителя — это рекламные ролики. Видеоряд остается в памяти человека надолго, если он сделан качественно и со вкусом. Но не каждый зритель принимает решение остановиться и посмотреть на него. Для того чтобы рекламный ролик действительно запомнился, необходимо учесть несколько ключевых моментов. Во-первых, важно иметь четко сформулированное сообщение, которое нужно донести до аудитории. Ролик должен быть лаконичным и нести основную идею максимально ярко и понятно.',
          date: '07.12.2023'
        },
        {
          img: '',
          title: 'Разработка интерактивных систем VR',
          txt: 'Наша компания предоставляет услуги не только по созданию трехмерных моделей и визуализации объектов, но и разрабатывает целые интерактивные проекты для различных целей, таких как виртуальные туры, обучающие приложения, игровые симуляторы и многое другое. Наш подход к разработке интерактивных проектов основан на инновационных технологиях и профессиональном подходе к каждому заказу.',
          date: '31.05.2023'
        },
        {
          img: '',
          title: 'Виртуальная реальность в обучении',
          txt: 'Виртуальная реальность меняет методы работы бизнеса. Прочитайте эту статью, чтобы узнать влияние VR на бизнес. Мы понимаем, что в современном мире визуальное восприятие играет ключевую роль, поэтому наши интерактивные проекты создаются с учетом самых последних тенденций в дизайне и разработке программного обеспечения.',
          date: '12.09.2022'
        },
      ]
    }
  },
  components: {
    NewsSwiper
  }
}

</script>

<style lang="scss" scoped>

.news__section {
  width: 100%;
  padding-top: 70px;
  
  .row {
    flex-direction: column;
    row-gap: 20px;
  }

  .news-title {
    font-size: 52px;
    font-weight: 500;
    text-transform: uppercase;
  }
}

</style>